InformationRegisters/ТЗ_Изделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТЗ_Изделий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвторСоздания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>1 принят, 2 отказ, 0 Ожидание, -1 новый</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлТЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омТЗСервер/Ext/Module.bsl
&НаСервере
Функция ПолучитьАдресВременногоХранилища(ОбъектТЗ, Версия, ИмяФайла, УникальныйИдентификатор) Экспорт

	Выборка = ПолучитьДанныеОФайле(ОбъектТЗ, Версия);
	
	Пока Выборка.Следующий() Цикл
		ИмяФайла = Выборка.ИмяФайла;
		ПолноеИмяФайла = КаталогВременныхФайлов()  + ИмяФайла + ".pdf";
		
		ДвоичныеДанные = Выборка.ФайлТЗ.Получить();
		
		Если ДвоичныеДанные = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		ДвоичныеДанные.Записать(ПолноеИмяФайла);
		
		Двоичное = Новый ДвоичныеДанные(ПолноеИмяФайла);  // получаем двоичные данные из файла
		Адрес = ПоместитьВоВременноеХранилище(Двоичное, УникальныйИдентификатор); // кидаем двоичные данные во врем. хранилище
		
		УдалитьФайлы(ПолноеИмяФайла);
		
		Возврат Адрес;
	КонецЦикла;
	
	Возврат "";

КонецФункции // ПолучитьАдресВременногоХранилища() 

&НаСервере
Функция ПолучитьДанныеОФайле(ОбъектТЗ, Версия)
	
	Запрос = Новый Запрос;
	Если Версия < 0 Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(ТЗ_Изделий.Версия) КАК Версия
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	РегистрСведений.ТЗ_Изделий КАК ТЗ_Изделий
			|ГДЕ
			|	ТЗ_Изделий.ОбъектТЗ = &ОбъектТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЗ_Изделий.ИмяФайла КАК ИмяФайла,
			|	ТЗ_Изделий.ФайлТЗ КАК ФайлТЗ
			|ИЗ
			|	РегистрСведений.ТЗ_Изделий КАК ТЗ_Изделий
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
			|		ПО ТЗ_Изделий.Версия = вт.Версия
			|ГДЕ
			|	ТЗ_Изделий.ОбъектТЗ = &ОбъектТЗ";
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗ_Изделий.ИмяФайла КАК ИмяФайла,
			|	ТЗ_Изделий.ФайлТЗ КАК ФайлТЗ
			|ИЗ
			|	РегистрСведений.ТЗ_Изделий КАК ТЗ_Изделий
			|ГДЕ
			|	ТЗ_Изделий.ОбъектТЗ = &ОбъектТЗ
			|	И ТЗ_Изделий.Версия = &Версия";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Выборка = РезультатЗапроса;
	
	Возврат Выборка;
	
КонецФункции // ПолучитьДанныеОФайле(ОбъектТЗ, Версия)
